// /* โจทย์ฝึกอัลกอริธึม โดยใช้ for loop
// จงเขียนโปรแกรมที่รับค่านึงเข้ามา และให้ทำการตามหาเลขจำนวนเฉพาะระหว่าง 0 ถึงตัวเลขที่ใส่เข้ามา
//   หลังจากนั้นโปรแกรมจะต้อง log ตัวเลขจำเฉพาะออกมา แบบนี้
//   สมมุติวาใส่ค่ามาให้ prompt = 10  จะต้อง log  2,3,5,7, ออกมา

//  ใบ้ให้ว่า  มีการใช้ break กับ continue
// */

// let a = +prompt("ใส้เลขมา");
// let targetNumber = 2;
// let primaryNumber = "";

// for (let i = 2; i <= a; i++) {
//   for (let j = 2; j <= i; j++) {}
// }

// console.log(primaryNumber);
